<!DOCTYPE html><html lang="zh-CN"><head><meta name="generator" content="Hexo 3.9.0"><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1"><meta name="robots" content="index, follow"><title>AHB • ASIC Fans</title><meta name="description" content="AHB - PYGC"><link rel="icon" href="/favicon.svg"><link rel="stylesheet" href="/css/nanoreset.min.css"><link rel="stylesheet" href="/css/theme.css"><link rel="search" type="application/opensearchdescription+xml" href="/atom.xml" title="ASIC Fans"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.11.1/dist/katex.css" integrity="sha384-bsHo4/LA+lkZv61JspMDQB9QP1TtO4IgOf2yYS+J6VdAYLVyx1c3XKcsHh0Vy8Ws" crossorigin="anonymous"><script defer src="https://cdn.jsdelivr.net/npm/katex@0.11.1/dist/katex.js" integrity="sha384-4z8mjH4yIpuK9dIQGR1JwbrfYsStrNK6MP+2Enhue4eyo0XlBDXOIPc8b6ZU0ajz" crossorigin="anonymous"></script><link rel="alternate" href="/atom.xml" title="ASIC Fans" type="application/atom+xml">
</head><body><div class="wrap" id="barba-wrapper"><header><h1 class="branding"><a href="/" title="ASIC Fans"><img class="logo-image" src="/blog.svg" alt="logo"></a></h1><h1 class="titletext"><a href="/">ASICFANS</a></h1><ul class="nav nav-list"><li class="nav-list-item"><a class="nav-list-link no-barba" href="/" target="_self">首页</a></li><li class="nav-list-item"><a class="nav-list-link no-barba" href="/about" target="_self">关于</a></li><li class="nav-list-item"><a class="nav-list-link no-barba" href="/tags" target="_self">分类</a></li><li class="nav-list-item"><a class="nav-list-link no-barba" href="/archives" target="_self">归档</a></li><li class="nav-list-item"><a class="nav-list-link no-barba" href="https://github.com/PYGC" target="_blank">GITHUB</a></li><li class="nav-list-item"><a class="nav-list-link no-barba" href="/atom.xml" target="_self">RSS</a></li></ul></header><div class="barba-container"><main class="container"><div class="post"><article class="post-block"><h1 class="post-title">AHB</h1><div class="post-info"><a></a>2019-11-26</div><div class="post-content"><p>AMBA&#x2122; Specification (Rev 2.0)</p>
<p>AHB &#x662F;&#x65B0;&#x4E00;&#x4EE3; AMBA &#x603B;&#x7EBF;&#xFF0C;&#x65E8;&#x5728;&#x6EE1;&#x8DB3;&#x9AD8;&#x6027;&#x80FD;&#x53EF;&#x7EFC;&#x5408;&#x8BBE;&#x8BA1;&#x7684;&#x8981;&#x6C42;&#x3002; &#x5B83;&#x662F;&#x4E00;&#x79CD;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x7CFB;&#x7EDF;&#x603B;&#x7EBF;&#xFF0C;&#x652F;&#x6301;&#x591A;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x63A7;&#x5668;&#x5E76;&#x63D0;&#x4F9B;&#x9AD8;&#x5E26;&#x5BBD;&#x64CD;&#x4F5C;&#x3002;</p>
<p>AMBA AHB &#x5B9E;&#x73B0;&#x4E86;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x9AD8;&#x65F6;&#x949F;&#x9891;&#x7387;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x7A81;&#x53D1;&#x4F20;&#x8F93;&#xFF08;Burst transfers&#xFF09;</li>
<li>&#x5206;&#x6BB5;&#x4F20;&#x8F93;&#xFF08;Split transfers&#xFF09;</li>
<li>&#x5355;&#x5468;&#x671F;&#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x4EA4;&#x63A5;&#xFF08;single-cycle bus master handover&#xFF09;</li>
<li>&#x5355;&#x65F6;&#x949F;&#x8FB9;&#x6CBF;&#x64CD;&#x4F5C;&#xFF08;single-clock edge operation&#xFF09;</li>
<li>&#x975E;&#x4E09;&#x6001;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF08;non-tristate implemention&#xFF09;</li>
<li>&#x5E7F;&#x6CDB;&#x7684;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x914D;&#x7F6E;&#xFF08;wider data bus configurations&#xFF09;64/128 bits</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x5728;&#x8F83;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x603B;&#x7EBF;&#x548C;&#x5F53;&#x524D;&#x7684; ASB/APB &#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x7684;&#x6865;&#x63A5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x96C6;&#x6210;&#x4EFB;&#x4F55;&#x73B0;&#x6709;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>AMBA AHB &#x8BBE;&#x8BA1;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x63A7;&#xFF0C;&#x901A;&#x5E38;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5C06;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x5904;&#x7406;&#x5668;&#x548C;&#x6D4B;&#x8BD5;&#x63A5;&#x53E3;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x5668;&#x8BBF;&#x95EE;&#xFF08;DMA&#xFF09;&#x6216;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x5668;&#xFF08;DSP&#xFF09;&#x88AB;&#x5305;&#x542B;&#x4E3A;&#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x4E5F;&#x5F88;&#x5E38;&#x89C1;&#x3002;</p>
<p>&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x5668;&#x63A5;&#x53E3;&#x3001;APB &#x6865;&#x548C;&#x4EFB;&#x4F55;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x5668;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684; AHB &#x4ECE;&#x8BBE;&#x5907;&#x3002; &#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5916;&#x56F4;&#x8BBE;&#x5907;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A; AHB &#x4ECE;&#x8BBE;&#x5907;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4F4E;&#x5E26;&#x5BBD;&#x5916;&#x56F4;&#x8BBE;&#x5907;&#x901A;&#x5E38;&#x4F4D;&#x4E8E; APB &#x4E0A;&#x3002;</p>
<p>&#x5178;&#x578B;&#x7684; AMBA AHB &#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x7EC4;&#x4EF6;&#xFF1A;</p>
<ul>
<li>AHB master: &#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x5730;&#x5740;&#x548C;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x6765;&#x542F;&#x52A8;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002; &#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x4E3B;&#x52A8;&#x4F7F;&#x7528;&#x8BE5;&#x603B;&#x7EBF;&#x3002;</li>
<li>AHB slave: &#x603B;&#x7EBF;&#x4ECE;&#x8BBE;&#x5907;&#x54CD;&#x5E94;&#x7ED9;&#x5B9A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x8303;&#x56F4;&#x5185;&#x7684;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002; &#x603B;&#x7EBF;&#x4ECE;&#x8BBE;&#x5907;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x6210;&#x529F;&#xFF0C;&#x5931;&#x8D25;&#x6216;&#x7B49;&#x5F85;&#x7684;&#x4FE1;&#x53F7;&#x53D1;&#x9001;&#x56DE;&#x6D3B;&#x52A8;&#x7684;&#x4E3B;&#x8BBE;&#x5907;&#x3002;</li>
<li>AHB arbiter: &#x603B;&#x7EBF;&#x4EF2;&#x88C1;&#x5668;&#x53EF;&#x786E;&#x4FDD;&#x4E00;&#x6B21;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x542F;&#x52A8;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002; &#x5373;&#x4F7F;&#x4EF2;&#x88C1;&#x534F;&#x8BAE;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5E94;&#x7528;&#x8981;&#x6C42;&#x5B9E;&#x73B0;&#x4EFB;&#x4F55;&#x4EF2;&#x88C1;&#x7B97;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x6216;&#x516C;&#x5E73;&#x8BBF;&#x95EE;&#x3002;AHB &#x4EC5;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x4EF2;&#x88C1;&#x5668;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x5355;&#x4E3B;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD9;&#x662F;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#x3002;</li>
<li>AHB decoder: AHB &#x8BD1;&#x7801;&#x5668;&#x7528;&#x4E8E;&#x89E3;&#x7801;&#x6BCF;&#x4E2A;&#x4F20;&#x8F93;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x4E3A;&#x4F20;&#x8F93;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x4ECE;&#x8BBE;&#x5907;&#x63D0;&#x4F9B;&#x9009;&#x62E9;&#x4FE1;&#x53F7;&#x3002;&#x5728;&#x6240;&#x6709; AHB &#x5B9E;&#x73B0;&#x4E2D;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x96C6;&#x4E2D;&#x5F0F;&#x89E3;&#x7801;&#x5668;&#x3002;</li>
</ul>
<h2 id="ahb-&#x4FE1;&#x53F7;&#x524D;&#x7F00;">AHB &#x4FE1;&#x53F7;&#x524D;&#x7F00;</h2>
<p><code>H</code> &#x8868;&#x793A;&#x662F;&#x4E00;&#x4E2A; AHB &#x4FE1;&#x53F7;&#x3002; &#x4F8B;&#x5982;&#xFF0C; <code>HREADY</code> &#x662F;&#x7528;&#x4E8E;&#x6307;&#x793A; AHB &#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x7684;&#x4FE1;&#x53F7;&#x3002; &#x9AD8;&#x7535;&#x5E73;&#x6709;&#x6548;&#x3002;</p>
<h2 id="ahb-&#x4FE1;&#x53F7;&#x5217;&#x8868;">AHB &#x4FE1;&#x53F7;&#x5217;&#x8868;</h2>
<p>AMBA AHB &#x4FE1;&#x53F7;</p>
<table>
<colgroup>
<col style="width: 10%">
<col style="width: 3%">
<col style="width: 86%">
</colgroup>
<thead>
<tr class="header">
<th style="text-align: center;">&#x540D;&#x79F0;</th>
<th style="text-align: center;">&#x6765;&#x6E90;</th>
<th style="text-align: left;">&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td style="text-align: center;"><strong>HCLK</strong> Bus clock</td>
<td style="text-align: center;">&#x65F6;&#x949F;&#x6E90;</td>
<td style="text-align: left;">&#x6B64;&#x65F6;&#x949F;&#x5BF9;&#x6240;&#x6709;&#x603B;&#x7EBF;&#x4F20;&#x8F93;&#x8FDB;&#x884C;&#x8BA1;&#x65F6;&#x3002; &#x6240;&#x6709;&#x4FE1;&#x53F7;&#x65F6;&#x5E8F;&#x90FD;&#x4E0E; <strong>HCLK</strong> &#x7684;&#x4E0A;&#x5347;&#x6CBF;&#x6709;&#x5173;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HRESETn</strong> Reset</td>
<td style="text-align: center;">&#x590D;&#x4F4D;&#x63A7;&#x5236;&#x5668;</td>
<td style="text-align: left;">&#x603B;&#x7EBF;&#x590D;&#x4F4D;&#x4FE1;&#x53F7;&#x4E3A;&#x4F4E;&#x7535;&#x5E73;&#x6709;&#x6548;&#xFF0C;&#x7528;&#x4E8E;&#x590D;&#x4F4D;&#x7CFB;&#x7EDF;&#x548C;&#x603B;&#x7EBF;&#x3002; &#x8FD9;&#x662F;&#x552F;&#x4E00;&#x7684;&#x4F4E;&#x7535;&#x5E73;&#x6709;&#x6548;&#x4FE1;&#x53F7;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HADDR[31:0]</strong> Address bus</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">32-bit &#x7CFB;&#x7EDF;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HTRANS[1:0]</strong> Transfer type</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x6307;&#x793A;&#x5F53;&#x524D;&#x4F20;&#x8F93;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x662F; NONSEQUENTIAL&#xFF0C;SEQUENTIAL&#xFF0C;IDLE &#x6216; BUSY&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HWRITE</strong> Transfer direction</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x5F53;&#x9AD8;&#x7535;&#x5E73;&#x65F6;&#xFF0C;&#x6B64;&#x4FE1;&#x53F7;&#x6307;&#x793A;&#x5199;&#x4F20;&#x8F93;&#xFF0C;&#x800C;&#x5F53;&#x4F4E;&#x7535;&#x5E73;&#x65F6;&#xFF0C;&#x6307;&#x793A;&#x8BFB;&#x4F20;&#x8F93;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HSIZE[2:0]</strong> Transfer size</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x6307;&#x793A;&#x4F20;&#x8F93;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x901A;&#x5E38;&#x4E3A;&#x5B57;&#x8282;&#xFF08;8&#x4F4D;&#xFF09;&#xFF0C;&#x534A;&#x5B57;&#xFF08;16&#x4F4D;&#xFF09;&#x6216;&#x5B57;&#xFF08;32&#x4F4D;&#xFF09;&#x3002; &#x8BE5;&#x534F;&#x8BAE;&#x5141;&#x8BB8;&#x66F4;&#x5927;&#x7684;&#x4F20;&#x8F93;&#x5927;&#x5C0F;&#xFF0C;&#x6700;&#x5927;&#x4E3A;1024&#x4F4D;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HBURST[2:0]</strong> Burst type</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x6307;&#x793A;&#x4F20;&#x8F93;&#x662F;&#x5426;&#x6784;&#x6210;&#x7A81;&#x53D1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x652F;&#x6301;&#x56DB;&#x4E2A;&#xFF0C;&#x516B;&#x4E2A;&#x548C;&#x5341;&#x516D;&#x4E2A;&#x62CD;&#x5B50;&#x7A81;&#x53D1;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x7A81;&#x53D1;&#x53EF;&#x4EE5;&#x9012;&#x589E;&#x6216;&#x73AF;&#x7ED5;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HPROT[3:0]</strong> Protection control</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x4FDD;&#x62A4;&#x63A7;&#x5236;&#x4FE1;&#x53F7;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x603B;&#x7EBF;&#x8BBF;&#x95EE;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x4E3B;&#x8981;&#x4F9B;&#x5E0C;&#x671B;&#x5B9E;&#x73B0;&#x67D0;&#x79CD;&#x7EA7;&#x522B;&#x4FDD;&#x62A4;&#x7684;&#x4EFB;&#x4F55;&#x6A21;&#x5757;&#x4F7F;&#x7528;&#x3002;&#x4FE1;&#x53F7;&#x6307;&#x793A;&#x4F20;&#x8F93;&#x662F;&#x64CD;&#x4F5C;&#x7801;&#x63D0;&#x53D6;&#x8FD8;&#x662F;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#xFF0C;&#x4EE5;&#x53CA;&#x4F20;&#x8F93;&#x662F;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#x8BBF;&#x95EE;&#x8FD8;&#x662F;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x8BBF;&#x95EE;&#x3002; &#x5BF9;&#x4E8E;&#x5E26;&#x6709;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;&#x7684;&#x603B;&#x7EBF;&#x4E3B;&#x63A7;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x53F7;&#x8FD8;&#x6307;&#x793A;&#x5F53;&#x524D;&#x8BBF;&#x95EE;&#x662F;&#x53EF;&#x7F13;&#x5B58;&#x8FD8;&#x662F;&#x53EF;&#x7F13;&#x5B58;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HWDATA[31:0]</strong> Write data bus</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x5728;&#x5199;&#x64CD;&#x4F5C;&#x671F;&#x95F4;&#xFF0C;&#x5199;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x7528;&#x4E8E;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E3B;&#x673A;&#x4F20;&#x8F93;&#x5230;&#x603B;&#x7EBF;&#x4ECE;&#x673A;&#x3002; &#x5EFA;&#x8BAE;&#x6700;&#x5C0F;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x5BBD;&#x5EA6;&#x4E3A;32&#x4F4D;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x6269;&#x5C55;&#x4EE5;&#x5141;&#x8BB8;&#x66F4;&#x9AD8;&#x7684;&#x5E26;&#x5BBD;&#x64CD;&#x4F5C;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HSELx</strong> Slave select</td>
<td style="text-align: center;">Decoder</td>
<td style="text-align: left;">&#x6BCF;&#x4E2A; AHB &#x4ECE;&#x673A;&#x90FD;&#x6709;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x4ECE;&#x673A;&#x9009;&#x62E9;&#x4FE1;&#x53F7;&#xFF0C;&#x8BE5;&#x4FE1;&#x53F7;&#x8868;&#x793A;&#x5F53;&#x524D;&#x4F20;&#x8F93;&#x662F;&#x9488;&#x5BF9;&#x6240;&#x9009;&#x4ECE;&#x673A;&#x7684;&#x3002; &#x8BE5;&#x4FE1;&#x53F7;&#x53EA;&#x662F;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x7684;&#x7EC4;&#x5408;&#x89E3;&#x7801;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HRDATA[31:0]</strong> Read data bus</td>
<td style="text-align: center;">Slave</td>
<td style="text-align: left;">&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x7528;&#x4E8E;&#x5728;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x671F;&#x95F4;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x603B;&#x7EBF;&#x4ECE;&#x8BBE;&#x5907;&#x4F20;&#x8F93;&#x5230;&#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x3002; &#x5EFA;&#x8BAE;&#x6700;&#x5C0F;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x5BBD;&#x5EA6;&#x4E3A;32&#x4F4D;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x6269;&#x5C55;&#x4EE5;&#x5141;&#x8BB8;&#x66F4;&#x9AD8;&#x7684;&#x5E26;&#x5BBD;&#x64CD;&#x4F5C;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HREADY</strong> Transfer done</td>
<td style="text-align: center;">Slave</td>
<td style="text-align: left;">&#x5F53; <strong>HREADY</strong> &#x4FE1;&#x53F7;&#x4E3A;HIGH&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x603B;&#x7EBF;&#x4E0A;&#x7684;&#x4F20;&#x8F93;&#x5DF2;&#x5B8C;&#x6210;&#x3002; &#x53EF;&#x4EE5;&#x5C06;&#x8BE5;&#x4FE1;&#x53F7;&#x9A71;&#x52A8;&#x4E3A;&#x4F4E;&#x7535;&#x5E73;&#x4EE5;&#x6269;&#x5C55;&#x4F20;&#x8F93;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x603B;&#x7EBF;&#x4E0A;&#x7684;&#x4ECE;&#x8BBE;&#x5907;&#x90FD;&#x9700;&#x8981;HREADY&#xFF0C;&#x56E0;&#x4E3A;&#x4E24;&#x8005;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HRESP[1:0]</strong> Transfer response</td>
<td style="text-align: center;">Slave</td>
<td style="text-align: left;">&#x4F20;&#x8F93;&#x54CD;&#x5E94;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x4F20;&#x8F93;&#x72B6;&#x6001;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x3002; &#x63D0;&#x4F9B;&#x4E86;&#x56DB;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x5373; OKAY&#xFF0C;ERROR&#xFF0C;RETRY &#x548C; SPLIT&#x3002;</td>
</tr>
</tbody>
</table>
<p>AMBA AHB &#x8FD8;&#x5177;&#x6709;&#x652F;&#x6301;&#x591A;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x8BBE;&#x5907;&#x64CD;&#x4F5C;&#x6240;&#x9700;&#x7684;&#x8BB8;&#x591A;&#x4FE1;&#x53F7;&#x3002; &#x8FD9;&#x4E9B;&#x4EF2;&#x88C1;&#x4FE1;&#x53F7;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x662F;&#x4E13;&#x7528;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x8FDE;&#x63A5;&#xFF0C;&#x4E0B;&#x8868;&#x4E2D;&#xFF0C;&#x540E;&#x7F00; <code>x</code> &#x8868;&#x793A;&#x4FE1;&#x53F7;&#x6765;&#x81EA;&#x6A21;&#x5757;X&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5C06;&#x6709;&#x8BB8;&#x591A; <code>HBUSREQx</code> &#x4FE1;&#x53F7;&#xFF0C;&#x4F8B;&#x5982; <code>HBUSREQarm</code>&#xFF0C; <code>HBUSREQdma</code> &#x548C; <code>HBUSREQtic</code>&#x3002;</p>
<table>
<colgroup>
<col style="width: 18%">
<col style="width: 9%">
<col style="width: 72%">
</colgroup>
<thead>
<tr class="header">
<th style="text-align: center;">&#x540D;&#x79F0;</th>
<th style="text-align: center;">&#x6765;&#x6E90;</th>
<th style="text-align: left;">&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td style="text-align: center;"><strong>HBUSREQx</strong> Bus request</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x4ECE;&#x603B;&#x7EBF;&#x4E3B;&#x63A7;&#x5668; x &#x5230;&#x603B;&#x7EBF;&#x4EF2;&#x88C1;&#x5668;&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x6307;&#x793A;&#x603B;&#x7EBF;&#x4E3B;&#x63A7;&#x5668;&#x9700;&#x8981;&#x603B;&#x7EBF;&#x3002;&#x7CFB;&#x7EDF;&#x4E2D;&#x6BCF;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x673A;&#x90FD;&#x6709;&#x4E00;&#x4E2A; <code>HBUSREQx</code> &#x4FE1;&#x53F7;&#xFF0C;&#x6700;&#x591A; 16 &#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x673A;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HLOCKx</strong> Locked transfers</td>
<td style="text-align: center;">Master</td>
<td style="text-align: left;">&#x5F53;&#x8BE5;&#x4FE1;&#x53F7;&#x4E3A;&#x9AD8;&#x7535;&#x5E73;&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x4E3B;&#x673A;&#x8981;&#x6C42;&#x9501;&#x5B9A;&#x8BBF;&#x95EE;&#x603B;&#x7EBF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8BE5;&#x4FE1;&#x53F7;&#x4E3A;&#x4F4E;&#x7535;&#x5E73;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x5E94;&#x51C6;&#x8BB8;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4E3B;&#x673A;&#x8BBF;&#x95EE;&#x603B;&#x7EBF;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HGRANTx</strong> Bus grant</td>
<td style="text-align: center;">Arbiter</td>
<td style="text-align: left;">&#x8BE5;&#x4FE1;&#x53F7;&#x8868;&#x660E;&#x603B;&#x7EBF;&#x4E3B;&#x673A; x &#x5F53;&#x524D;&#x662F;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4E3B;&#x673A;&#x3002; &#x5F53; HREADY &#x4E3A; HIGH &#x65F6;&#xFF0C;&#x5730;&#x5740;/&#x63A7;&#x5236;&#x4FE1;&#x53F7;&#x7684;&#x6240;&#x6709;&#x6743;&#x5728;&#x4F20;&#x8F93;&#x7ED3;&#x675F;&#x65F6;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5F53; HREADY &#x548C; HGRANTx &#x5747;&#x4E3A; HIGH &#x65F6;&#xFF0C;&#x4E3B;&#x673A;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x603B;&#x7EBF;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HMASTER[3:0]</strong> Master number</td>
<td style="text-align: center;">Arbiter</td>
<td style="text-align: left;">&#x6765;&#x81EA;&#x4EF2;&#x88C1;&#x5668;&#x7684;&#x8FD9;&#x4E9B;&#x4FE1;&#x53F7;&#x6307;&#x793A;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x54EA;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x673A;&#xFF0C;&#x5E76;&#x88AB;&#x652F;&#x6301; SPLIT &#x4F20;&#x8F93;&#x7684;&#x4ECE;&#x673A;&#x7528;&#x6765;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x4E3B;&#x673A;&#x6B63;&#x5728;&#x5C1D;&#x8BD5;&#x8BBF;&#x95EE;&#x3002; HMASTER &#x7684;&#x65F6;&#x5E8F;&#x4E0E;&#x5730;&#x5740;&#x548C;&#x63A7;&#x5236;&#x4FE1;&#x53F7;&#x7684;&#x65F6;&#x5E8F;&#x5BF9;&#x9F50;&#x3002;</td>
</tr>
<tr class="odd">
<td style="text-align: center;"><strong>HMASTLOCK</strong> Locked sequence</td>
<td style="text-align: center;">Arbiter</td>
<td style="text-align: left;">&#x6307;&#x793A;&#x5F53;&#x524D;&#x7684;&#x4E3B;&#x673A;&#x6B63;&#x5728;&#x6267;&#x884C;&#x9501;&#x5B9A;&#x7684;&#x4F20;&#x8F93;&#x5E8F;&#x5217;&#x3002; &#x8BE5;&#x4FE1;&#x53F7;&#x4E0E; HMASTER &#x4FE1;&#x53F7;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x65F6;&#x5E8F;&#x3002;</td>
</tr>
<tr class="even">
<td style="text-align: center;"><strong>HSPLITx[15:0]</strong> Split completion request</td>
<td style="text-align: center;">Slave (SPLIT capable)</td>
<td style="text-align: left;">&#x4ECE;&#x673A;&#x4F7F;&#x7528;&#x6B64;16&#x4F4D;&#x5206;&#x6BB5;&#x603B;&#x7EBF;&#x5411;&#x4EF2;&#x88C1;&#x5668;&#x6307;&#x793A;&#x5E94;&#x5141;&#x8BB8;&#x54EA;&#x4E9B;&#x603B;&#x7EBF;&#x4E3B;&#x673A;&#x91CD;&#x65B0;&#x5C1D;&#x8BD5;&#x5206;&#x6BB5;&#x4E8B;&#x52A1;&#x3002; &#x8BE5;&#x5206;&#x6BB5;&#x603B;&#x7EBF;&#x7684;&#x6BCF;&#x4E00;&#x4F4D;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x603B;&#x7EBF;&#x4E3B;&#x63A7;&#x3002;</td>
</tr>
</tbody>
</table>
</div></article></div></main><footer><div class="paginator"><a class="prev" href="/2019/12/03/玩转SVG！/">前一个</a><a class="next" href="/2019/11/20/从源码编译安装-iverilog/">后一个</a></div><div id="disqus_thread"></div><script>var disqus_shortname = 'kismetliu';
var disqus_identifier = '2019/11/26/AHB/';
var disqus_title = 'AHB';
var disqus_url = 'http://yoursite.com/2019/11/26/AHB/';
(function () {
    var dsq = document.createElement('script'); dsq.async = true;
    dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//kismetliu.disqus.com/count.js" async></script><div class="copyright"><p>&copy; 2019 <a href="https://blog.asicfans.com">Kismet Liu</a><br>Powered by <a href="https://hexo.io/" rel="noreferrer" target="_blank">Hexo</a></p></div></footer></div></div><script>var _gaq = _gaq || [];
_gaq.push(['_setAccount', 'UA-86660611-1']);
_gaq.push(['_trackPageview']);

(function () {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
})();</script><script src="https://cdnjs.cloudflare.com/ajax/libs/barba.js/1.0.0/barba.min.js"></script><script>document.addEventListener('DOMContentLoaded', function() {
    Barba.Pjax.start()
})</script></body></html>